driver-tests/bpelse/PartnerLinks/PLTLocalNamespaceJBI/test/results/TestLocalPLT/Actual_20130401123516_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <strElem xmlns="http://xml.netbeans.org/schema/PLTLocalNamespaceSchema" xmlns:msgns="http://j2ee.netbeans.org/wsdl/PLTLocalNamespace">PLTLocalNamespace proj was deployed and run successfully:</strElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>