driver-tests/bpelse/PartnerLinks/PLTLocalNamespaceJBI/test/TestLocalPLT/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:plt="http://xml.netbeans.org/schema/PLTLocalNamespaceSchema">
  <soapenv:Body>
    <plt:strElem>PLTLocalNamespace proj</plt:strElem>
  </soapenv:Body>
</soapenv:Envelope>