driver-tests/bpelse/PartnerLinks/PLTLocalNamespaceJBI/test/TestLocalPLT/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <someNS:strElem xmlns:someNS="http://xml.netbeans.org/schema/PLTLocalNamespaceSchema">PLTLocalNamespace proj was deployed and run successfully:</someNS:strElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
